Microchip-MPLAB-Harmony/motor_control/apps/acim_vhz_pic32_cm_mc/firmware/src/packs/PIC32CM1216MC00048_DFP/component/dsu.h
/* -------- DSU_DID : (DSU Offset: 0x18) ( R/ 32) Device Identification -------- */
#define DSU_DID_DEVSEL_Pos                    _U_(0)                                               /**< (DSU_DID) Device Select Position */
#define DSU_DID_DEVSEL_Msk                    (_U_(0xFF) << DSU_DID_DEVSEL_Pos)                    /**< (DSU_DID) Device Select Mask */
#define DSU_DID_DEVSEL(value)                 (DSU_DID_DEVSEL_Msk & ((value) << DSU_DID_DEVSEL_Pos))
#define   DSU_DID_DEVSEL_128KB_16KB_32PIN_Val _U_(0x0)                                             /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 32-pin  */
#define   DSU_DID_DEVSEL_64KB_8KB_32PIN_Val   _U_(0x1)                                             /**< (DSU_DID) 64 KB Flash / 8 KB SRAM / 32-pin  */
#define   DSU_DID_DEVSEL_128KB_16KB_48PIN_CAN_Val _U_(0x6)                                             /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 48-pin  */
#define   DSU_DID_DEVSEL_64KB_8KB_48PIN_CAN_Val _U_(0x7)                                             /**< (DSU_DID) 64 KB Flash / 8 KB SRAM / 48-pin  */
#define DSU_DID_DEVSEL_128KB_16KB_32PIN       (DSU_DID_DEVSEL_128KB_16KB_32PIN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 32-pin Position  */
#define DSU_DID_DEVSEL_64KB_8KB_32PIN         (DSU_DID_DEVSEL_64KB_8KB_32PIN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 64 KB Flash / 8 KB SRAM / 32-pin Position  */
#define DSU_DID_DEVSEL_128KB_16KB_48PIN_CAN   (DSU_DID_DEVSEL_128KB_16KB_48PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 48-pin Position  */
#define DSU_DID_DEVSEL_64KB_8KB_48PIN_CAN     (DSU_DID_DEVSEL_64KB_8KB_48PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 64 KB Flash / 8 KB SRAM / 48-pin Position  */
#define DSU_DID_REVISION_Pos                  _U_(8)                                               /**< (DSU_DID) Revision Number Position */
#define DSU_DID_REVISION_Msk                  (_U_(0xF) << DSU_DID_REVISION_Pos)                   /**< (DSU_DID) Revision Number Mask */
#define DSU_DID_REVISION(value)               (DSU_DID_REVISION_Msk & ((value) << DSU_DID_REVISION_Pos))
#define DSU_DID_DIE_Pos                       _U_(12)                                              /**< (DSU_DID) Die Number Position */
#define DSU_DID_DIE_Msk                       (_U_(0xF) << DSU_DID_DIE_Pos)                        /**< (DSU_DID) Die Number Mask */
#define DSU_DID_DIE(value)                    (DSU_DID_DIE_Msk & ((value) << DSU_DID_DIE_Pos))    
#define DSU_DID_SERIES_Pos                    _U_(16)                                              /**< (DSU_DID) Series Position */
#define DSU_DID_SERIES_Msk                    (_U_(0x3F) << DSU_DID_SERIES_Pos)                    /**< (DSU_DID) Series Mask */
#define DSU_DID_SERIES(value)                 (DSU_DID_SERIES_Msk & ((value) << DSU_DID_SERIES_Pos))
#define   DSU_DID_SERIES_MC00_Val             _U_(0x6)                                             /**< (DSU_DID) PIC32CM MC00  */
#define DSU_DID_SERIES_MC00                   (DSU_DID_SERIES_MC00_Val << DSU_DID_SERIES_Pos)      /**< (DSU_DID) PIC32CM MC00 Position  */
#define DSU_DID_FAMILY_Pos                    _U_(23)                                              /**< (DSU_DID) Family Position */
#define DSU_DID_FAMILY_Msk                    (_U_(0x1F) << DSU_DID_FAMILY_Pos)                    /**< (DSU_DID) Family Mask */
#define DSU_DID_FAMILY(value)                 (DSU_DID_FAMILY_Msk & ((value) << DSU_DID_FAMILY_Pos))
#define   DSU_DID_FAMILY_2_Val                _U_(0x2)                                             /**< (DSU_DID) 5V Industrial  */
#define DSU_DID_FAMILY_2                      (DSU_DID_FAMILY_2_Val << DSU_DID_FAMILY_Pos)         /**< (DSU_DID) 5V Industrial Position  */
#define DSU_DID_PROCESSOR_Pos                 _U_(28)                                              /**< (DSU_DID) Processor Position */
#define DSU_DID_PROCESSOR_Msk                 (_U_(0xF) << DSU_DID_PROCESSOR_Pos)                  /**< (DSU_DID) Processor Mask */
#define DSU_DID_PROCESSOR(value)              (DSU_DID_PROCESSOR_Msk & ((value) << DSU_DID_PROCESSOR_Pos))
#define   DSU_DID_PROCESSOR_1_Val             _U_(0x1)                                             /**< (DSU_DID) Cortex-M0+  */
#define DSU_DID_PROCESSOR_1                   (DSU_DID_PROCESSOR_1_Val << DSU_DID_PROCESSOR_Pos)   /**< (DSU_DID) Cortex-M0+ Position  */
#define DSU_DID_Msk                           _U_(0xFFBFFFFF)                                      /**< (DSU_DID) Register Mask  */


/* -------- DSU_DCFG : (DSU Offset: 0xF0) (R/W 32) Device Configuration -------- */
#define DSU_DCFG_RESETVALUE                   _U_(0x00)                                            /**<  (DSU_DCFG) Device Configuration  Reset Value */

#define DSU_DCFG_DCFG_Pos                     _U_(0)                                               /**< (DSU_DCFG) Device Configuration Position */
#define DSU_DCFG_DCFG_Msk                     (_U_(0xFFFFFFFF) << DSU_DCFG_DCFG_Pos)               /**< (DSU_DCFG) Device Configuration Mask */
#define DSU_DCFG_DCFG(value)                  (DSU_DCFG_DCFG_Msk & ((value) << DSU_DCFG_DCFG_Pos))
#define DSU_DCFG_Msk                          _U_(0xFFFFFFFF)                                      /**< (DSU_DCFG) Register Mask  */


/* -------- DSU_ENTRY0 : (DSU Offset: 0x1000) ( R/ 32) CoreSight ROM Table Entry 0 -------- */
#define DSU_ENTRY0_RESETVALUE                 _U_(0x9F0FC002)                                      /**<  (DSU_ENTRY0) CoreSight ROM Table Entry 0  Reset Value */

#define DSU_ENTRY0_EPRES_Pos                  _U_(0)                                               /**< (DSU_ENTRY0) Entry Present Position */
#define DSU_ENTRY0_EPRES_Msk                  (_U_(0x1) << DSU_ENTRY0_EPRES_Pos)                   /**< (DSU_ENTRY0) Entry Present Mask */
#define DSU_ENTRY0_EPRES(value)               (DSU_ENTRY0_EPRES_Msk & ((value) << DSU_ENTRY0_EPRES_Pos))
#define DSU_ENTRY0_FMT_Pos                    _U_(1)                                               /**< (DSU_ENTRY0) Format Position */
#define DSU_ENTRY0_FMT_Msk                    (_U_(0x1) << DSU_ENTRY0_FMT_Pos)                     /**< (DSU_ENTRY0) Format Mask */
#define DSU_ENTRY0_FMT(value)                 (DSU_ENTRY0_FMT_Msk & ((value) << DSU_ENTRY0_FMT_Pos))
#define DSU_ENTRY0_ADDOFF_Pos                 _U_(12)                                              /**< (DSU_ENTRY0) Address Offset Position */
#define DSU_ENTRY0_ADDOFF_Msk                 (_U_(0xFFFFF) << DSU_ENTRY0_ADDOFF_Pos)              /**< (DSU_ENTRY0) Address Offset Mask */
#define DSU_ENTRY0_ADDOFF(value)              (DSU_ENTRY0_ADDOFF_Msk & ((value) << DSU_ENTRY0_ADDOFF_Pos))
#define DSU_ENTRY0_Msk                        _U_(0xFFFFF003)                                      /**< (DSU_ENTRY0) Register Mask  */


/* -------- DSU_ENTRY1 : (DSU Offset: 0x1004) ( R/ 32) CoreSight ROM Table Entry 1 -------- */
#define DSU_ENTRY1_RESETVALUE                 _U_(0x5002)                                          /**<  (DSU_ENTRY1) CoreSight ROM Table Entry 1  Reset Value */

